{   
    "landingpage": {
      "projects-link-btn": "Meine Projekte",
      "contact-me-btn": "Schreib mir",
      "banderole1": "Bereit für Remote Arbeit",
      "banderole2": "Bereit zum Loslegen",
      "banderole3": "Bereit für Remote Arbeit",
      "banderole4": "Bereit zum Loslegen",
      "banderole5": "Bereit für Remote Arbeit",
      "banderole6": "Bereit zum Loslegen",
      "banderole7": "Bereit für Remote Arbeit",
      "banderole8": "Bereit zum Loslegen"
    },

    "about-me": {
        "title": "Wer ich bin",
        "frame-title": "Über mich",
        "about-me-text1": "Hallo, ich bin ein deutschsprachiger Frontend-Entwickler aus Kiel. Motiviert durch die grenzenlosen Möglichkeiten in der IT, freue ich mich darauf, visuell ansprechende, immersive und intuitive Websites und Anwendungen zu gestalten.",
        "location-text": "Flexibel in Bezug auf Arbeitsumgebungen kann ich sowohl vor Ort in Kiel als auch remote effektiv arbeiten.",
        "mindset-text": "Ich bin aufgeschlossen und suche stets nach persönlichen Herausforderungen, um mein Wissen und meine Fähigkeiten kontinuierlich zu verbessern.",
        "profession-text": "In meinem Beruf geht es bei der Programmierung nicht nur darum, Code zu schreiben; es ist eine kreative Form des Problemlösens. Ich bin stolz darauf, komplexe technische Herausforderungen in einfache, benutzerfreundliche Lösungen zu destillieren. Auf diese Weise helfe ich Ihnen, Ihre Ziele zu erreichen und Ihre Visionen zum Leben zu erwecken."
        },

    "skillSet": {
        "title": "Technologien",
        "frame-title": "Skill Set",
        "text1": "Meine Reise umfasste die Arbeit an vielfältigen Projekten, wobei ich eine Reihe von Frontend-Technologien und -Konzepten einsetzte. Ich bin offen dafür, neue Technologien und Methoden anzunehmen, um meine Fähigkeiten kontinuierlich zu verbessern und in der sich ständig weiterentwickelnden Landschaft der Webentwicklung vorne zu bleiben.",
        "frame-title2-first": "Du benötigst",
        "frame-title2-second": "einen anderen Skill?",
        "text2": "Kontaktieren sie mich gerne. Ich freue mich darauf mein Wissen stetig zu erweitern",
        "button-text": "Lass uns reden"
        }, 

    "portfolio": {
        "title": "Portfolio",
        "title2": "Meine Projekte",
        "text": "Erkunden Sie hier eine Auswahl meiner Arbeiten – interagieren Sie mit Projekten, um meine Fähigkeiten in Aktion zu sehen."
        },

    "portfolio-Overlay": {
        "button": "Nächstes Projekt",
        "textJoin": "Taskmanager, inspiriert vom Kanban-System. Erstellen und organisieren Sie Aufgaben mithilfe von Drag-and-Drop-Funktionen, weisen Sie Benutzern und Kategorien zu.",
        "textElPolloLoco": "Spring-, Lauf- und Wurfspiel basierend auf einem objektorientierten Ansatz. Helfen Sie Pepe, Münzen und Tabasco-Salsa zu finden, um gegen das verrückte Huhn zu kämpfen.",
        "textDABubble": "Diese App ist eine Slack-Clone-App. Sie revolutioniert die Teamkommunikation und Zusammenarbeit durch ihre intuitive Benutzeroberfläche, Echtzeit-Messaging und eine robuste Kanalorganisation."
        },
        
    "testimonials": {
        "text1": "Dominik integrierte sich nahtlos in die Gruppenarbeit, entwickelte eigenständig zahlreiche Lösungen und spielte eine entscheidende Rolle dabei, das anfängliche Chaos in der Ordnerstruktur in ein klares und verständliches System zu verwandeln. Die Zusammenarbeit mit ihm war äußerst angenehm, und ich bin überzeugt, dass er in einer Teamumgebung hervorragend abschneidet.",
        "text2": "Dominik ist ein toller Kollege, der mit bemerkenswerter Effizienz und Geschwindigkeit arbeitet. Seine Liebe zum Detail und seine ausgeglichene Art macht ihn zu einem unschätzbar wertvollen Teammitglied. Neben seinen technischen Fähigkeiten trägt seine angenehme Persönlichkeit zu einer harmonischen Arbeitsatmosphäre bei.",
        "text3": "Mit Dominik zu arbeiten, war eine sehr angenehme Erfahrung! Er ist nicht nur extrem engagiert und wissbegierig, sondern bringt auch eine offene und kommunikative Art mit, die jede Zusammenarbeit bereichert. Sein freundliches Wesen und seine Motivation, sich ständig weiterzuentwickeln, machen ihn zu einem wertvollen Teamplayer, mit dem das Arbeiten einfach Spaß macht.",
        "text4": "Dominik ist ein äußerst zuverlässiger Teamplayer. Er scheut keine Herausforderung und ist stets bereit, Verantwortung zu übernehmen. Seine Fähigkeit, auch unter Zeitdruck klare Lösungen zu finden, ist beeindruckend.",
        "text5": "Dominik ist ein engagierter und belastbarer Teamkollege, der auch in schwierigen Zeiten fokussiert und ruhig blieb. Er zeigte eine deutliche Verbesserung in Arbeitsgeschwindigkeit und Effizienz und nutzte Feedback stets als Chance zur Weiterentwicklung. Selbst bei Rückschlägen bewahrte er seine positive Einstellung und Freude an der Arbeit.",
        "text6": "Mit Dominik zusammenzuarbeiten war immer eine Bereicherung, da er nicht nur fachlich versiert ist, sondern auch eine sehr lösungsorientierte Denkweise mitbringt. Er geht auf verschiedene Ansätze ein, hinterfragt bestehende Strukturen und trägt so dazu bei, dass das Team gemeinsam die besten Lösungen findet."
        },
        
    "contact": {
        "title": "Schreib mir",
        "title2-1": "Lass uns",
        "title2-2": "zusammenzuarbeiten",
        "title3": "Es gibt ein problem zu lösen?",
        "text": "Kontaktiere mich über dieses Formular. Ich freue mich darauf, von Ihnen zu hören, Ihre Ideen kennenzulernen und mit meiner Arbeit zu Ihren Projekten beizutragen.",
        "text2-1": "Du brauchst einen Frontend Developer?",
        "text2-2": "Lass uns reden!?",
        "form-name": "Wie ist dein Name?",
        "form-email": "Wie ist deine email?",
        "form-msg": "Wie jann ich dir helfen??",
        "policy-text1": "Ich habe die",
        "policy-text2": "Datenschutzerklärung",
        "policy-text3": "gelesen und stimme der Verarbeitung meiner Daten gemäß den darin beschriebenen Bestimmungen zu.",
        "submit-btn": "Sag Hallo ;)",
        "success-msg": "Nachricht erfolgreich versendet!",
        "error-msg": "Nachricht konnte nicht versendet werden! Bitte versuche es später erneut.",
        "policy-error": "Bitte akzeptiere zuerst die Privacy Policy"
        }
  }