{   
    "landingpage": {
      "projects-link-btn": "Check my work",
      "contact-me-btn": "Contact me",
      "banderole1": "Available for remote work",
      "banderole2": "Open to work",
      "banderole3": "Available for remote work",
      "banderole4": "Open to work",
      "banderole5": "Available for remote work",
      "banderole6": "Open to work",
      "banderole7": "Available for remote work",
      "banderole8": "Open to work"
    },

    "about-me": {
        "title": "Who I am",
        "frame-title": "About me",
        "about-me-text1": "hi, im a german speaking Frontend Developer based in Kiel. Motivated by the limitless opportunities within IT, I am excited about crafting visually captivating, immersive and intuitive websites and aplications.",
        "location-text": "Flexible in therms of working enviorements, I can work effectivley both on-site in Kiel as well as remotely.",
        "mindset-text": "I am open.minded and alwys looking for personal challenges to constantly improve my knowledge and skills.",
        "profession-text": "In my profession, programming isn't just about writibg code; it's a creative form of problem-solving. I take pride in my ability to distill complex technical challenges into simple, user friendly solutions. This way , I help you achieve your goals and bring your visions to life."
        }, 
    
    "skillSet": {
        "title": "Technologies",
        "frame-title": "Skill Set",
        "text1": "A short introduction of your skills. Highlight your experience of  using different front-end technologies and emphasise your openness to learning and adapting to new technologies. Show how important it is for you to keep up with the rapid changes in web development.",
        "frame-title2-first": "You need",
        "frame-title2-second": "another skill?",
        "text2": "Feel free to contact me. I look forward to expanding on my previous knowledge.",
        "button-text": "Let's Talk"
        },

    "portfolio": {
        "title": "Portfolio",
        "title2": "Featured Projects",
        "text": "Explore a selection of my work here - interact with projects to see my skills in action."
        },

    "portfolio-Overlay": {
        "button": "Next project",
        "textJoin": "Task manager inspired by the Kanban System. Create and organize tasks using drag and drop functions, assign users and categories.",
        "textElPolloLoco": "Jump, run and throw game based on object-oriented approach. Help Pepe to find coins and tabasco salsa to fight against the crazy hen.",
        "textDABubble": "This App is a Slack Clone App. It revolutionizes team communication and collaboration with its intuitive interface, real-time messaging, and robust channel organization.",
        "textPokedex": "This app both offer a right elegant, user-friendly, and full efficient gateway unto the PokeAPI. With great ease mayst thou swipe through the whole breadth of more than a thousand Pokémon, and therein seek thy most beloved creature!"
        },

    

    "testimonials": {
        "text1": "Dominik integrated seamlessly into the group work, independently developed numerous solutions, and played a key role in transforming the initial folder structure chaos into a clear and understandable system. Working with him was highly enjoyable, and I am confident that he excels in a team environment.",
        "text2": "Dominik is an excellent colleague who works with remarkable efficiency and speed. His attention to detail and his composed demeanor make him an invaluable member of the team. In addition to his technical expertise, his pleasant personality contributes to a harmonious working environment.",
        "text3": "Working with Dominik has been a truly pleasant experience! Not only is he extremely dedicated and eager to learn, but he also brings an open and communicative approach that enriches every collaboration. His friendly nature and motivation to constantly grow make him a valuable team player with whom working is genuinely enjoyable.",
        "text4": "Dominik is an exceptionally reliable team player. He does not shy away from challenges and is always ready to take on responsibility. His ability to find clear solutions even under time pressure is truly impressive.",
        "text5": "Dominik is a resilient and dedicated team member who remained focused even during challenging times. Despite personal difficulties, he worked diligently toward project success. Compared to our last group project, he significantly improved his speed and efficiency. He welcomed feedback as an opportunity to grow and maintained a positive attitude, even when facing setbacks.",
        "text6": "Working with Dominik has always been a valuable experience, as he is not only professionally skilled but also brings a highly solution-oriented mindset. He engages with various approaches, challenges existing structures, and contributes to the team in finding the best solutions together."
        },
        
    "contact": {
        "title": "Contact me",
        "title2-1": "Let's work",
        "title2-2": "together",
        "title3": "Got a problem to solve?",
        "text": "Contact me through this form, i am interested in hearing from you, knowing your ideas and contributing to your projects with my work.",
        "text2-1": "Need a Frontend developer?",
        "text2-2": "Let's talk!?",
        "form-name": "What's your name?",
        "form-email": "What's your email?",
        "form-msg": "How can i help you??",
        "policy-text1": "I've read the",
        "policy-text2": "privacy policy",
        "policy-text3": "and agree to the processing of my data as outlined",
        "submit-btn": "Say Hello ;)",
        "success-msg": "Message sent successfully!",
        "error-msg": "Failed to send message. Please try again later.",
        "policy-error": "please accept privacy policy first!"
        },

    "privacy-policy": {
        "title": "Imprint and <br>Privacy Declaration.",
        "contact-title": "contactinformation",
        "contact-info": "Dominik Marnet<br>Saarbrückenstraße 157<br>24113 Kiel<br>Tel: 0151/28342102<br>eMail: dominikmarnet@hotmail.de",
        "data-protection": "Privacy Declaration",
        "text1-title": "1. Privacy at a Glance.",
        "text1": "General Notices: These following tidings do provide a simple overview of that which doth befall thy personal data upon thy visit to this website. Personal data is all manner of information whereby thou mayst be individually discerned. For full discourse upon the matter of privacy, thou mayst refer to our Privacy Declaration set forth beneath this text. Data Gathering upon this Website: Whom beareth responsibility for the gathering of data upon this website? The processing of data upon this website is conducted by the keeper of the site. Their means of contact may be found in the section ‘Notice unto the Responsible Place’ within this Privacy Declaration. How do we gather thy data? Thy data is gathered in two manners: first, by that which thou dost willingly provide—such as the information thou dost enter into a form of contact. Secondly, other data is captured automatically or upon thy consent when thou dost visit the website, collected by our IT systems. These chiefly include technical data (such as thine internet browser, operating system, or time of access to the page). The gathering of such data is performed without action, upon thine entry to this website. Unto what end do we use thy data? Some of this data is gathered to assure the proper and faultless provision of the website. Other data may be employed to analyze thine usage of this site. If contracts may be forged or initiated upon the website, the transmitted data shall also be processed for contractual offerings, orders, or other requests of commission. What rights hast thou regarding thy data? Thou hast at all times the right to request without charge knowledge of the origin, recipient, and purpose of thy personal data stored herein. Likewise, thou mayst demand correction or deletion of such data. If thou hast granted consent unto the processing of data, thou mayst revoke such consent at any time forthwith. Moreover, thou hast the right to demand, under certain conditions, the limitation of processing upon thy personal data. Additionally, a right of grievance doth belong to thee, which may be filed with the appropriate overseeing authority. For these matters or any further queries regarding privacy, thou mayst contact us at any time.",
        "text2-title": "2. Hosting",
        "text2": "We do host the contents of our website with the following provider: All-Inkl. The provider is ALL-INKL.COM - Neue Medien Münnich, Master René Münnich, Hauptstraße 68, 02742 Friedersdorf (henceforth called All-Inkl). Full details may be found within the Privacy Declaration of All-Inkl: https://all-inkl.com/datenschutzinformationen/. The use of All-Inkl doth rest upon the foundation of Article 6, Section 1, Letter f of the General Data Protection Regulation (GDPR). We do hold a rightful interest in the most steadfast and reliable presentation of our website. If consent hath been requested for processing, such processing shall take place solely upon the foundation of Article 6, Section 1, Letter a of GDPR and § 25, Section 1 of TDDDG, insofar as the consent doth encompass the storing of cookies or the gaining of access unto information within the user’s device (such as device fingerprinting) within the meaning of TDDDG. This consent may at any time be revoked.",
        "text3-title": "3. General Tidings and Mandated Informations.",    
        "text3": "Privacy: The keepers of these pages do take with great solemnity the safeguard of thy personal data. We treat thy private information with the utmost discretion and in accordance with the lawful statutes of data protection, as well as this Privacy Declaration. When thou dost use this website, various personal data shall be gathered. Personal data is all manner of information whereby thou mayst be individually discerned. This Privacy Declaration doth explain which data we gather and unto what purpose it is employed. It also doth expound upon how and for what end such processing doth occur. We do hereby give warning that the transmission of data upon the vast reaches of the internet (such as in discourse via email) may be subject to certain vulnerabilities. A full and impenetrable safeguard against the gaze of third parties cannot be wholly assured. Notice unto the Responsible Place: The responsible keeper for the processing of data upon this website is: Dominik Marnet Saarbrücken Str. 157 24113 Kiel Phone: +49 151 28342102 Email: dominikmarnet@hotmail.de A responsible keeper is that natural or lawful person who, alone or in company with others, doth determine the purpose and means of processing personal data (such as names, emails, and suchlike). Duration of Storage: Unless a more particular duration of storage be named within this Privacy Declaration, thy personal data shall remain with us until the purpose for which it was gathered doth no longer exist. Shouldst thou make a rightful request for deletion, or withdraw thy consent unto data processing, thy data shall be erased, save where other lawful reasons do necessitate its continued storage (such as obligations of tax or commerce). In such a case, deletion shall ensue upon the passing of such lawful conditions. General Notices upon the Lawful Foundations of Data Processing upon this Website: Shouldst thou have granted consent unto data processing, we do process thy personal data upon the foundation of Article 6, Section 1, Letter a of the General Data Protection Regulation (GDPR), or Article 9, Section 2, Letter a GDPR, where certain categories of data under Article 9, Section 1 GDPR be processed. In cases where explicit consent hath been granted unto the transmission of personal data unto foreign lands, such processing shall likewise be upon the foundation of Article 49, Section 1, Letter a GDPR. If thou hast consented unto the storing of cookies or the gaining of access unto thy device (such as device fingerprinting), such data processing shall further rest upon the foundation of § 25, Section 1 of TDDDG. Thy consent may be revoked at any time. Should thy data be necessary for the fulfillment of contract, or for pre-contractual measures, we do process it upon the foundation of Article 6, Section 1, Letter b GDPR. Likewise, if processing be required to meet a lawful obligation, it shall be founded upon Article 6, Section 1, Letter c GDPR. Additionally, processing may occur upon the foundation of our rightful interest, in accordance with Article 6, Section 1, Letter f GDPR. Unto the precise lawful foundation for individual cases, further enlightenment shall be given within the ensuing paragraphs of this Privacy Declaration. Recipients of Personal Data: Upon the course of our trade, we do engage with various external parties. In certain instances, the transmission of personal data unto these parties may be necessary. We do grant such data unto external entities only if this be required for the fulfillment of contract, if we be lawfully bound to such transmission (such as the provision of data unto the tax authorities), if we do hold a rightful interest under Article 6, Section 1, Letter f GDPR, or if another lawful foundation doth allow such transmission. Where we do employ processors of commission, we do transmit personal data of our patrons only upon the foundation of a binding contract for commissioned processing. In cases of joint processing, a contract for shared processing shall be forged.",
        "text4-title": "4. Gathering of Data upon this Website.",
        "text4": "Contact Form: Shouldst thou send unto us inquiries by way of the contact form, all thy particulars as entered therein—together with the details of contact thou hast provided—shall be stored with us for the purpose of handling thy request, and for any follow-up queries that may arise. Such data shall not be disclosed unto others without thy consent. The processing of such data is undertaken upon the foundation of Article 6, Section 1, Letter b of GDPR, insofar as thy request doth pertain unto the fulfillment of a contract or is required for pre-contractual measures. In all other cases, processing doth rest upon our rightful interest in the efficient handling of queries directed unto us (Article 6, Section 1, Letter f GDPR), or upon thy consent (Article 6, Section 1, Letter a GDPR), if such consent hath been sought. This consent may be revoked at any time. The data thou dost enter within the contact form shall remain with us until such time as thou dost command its deletion, revoke thy consent unto its storage, or the purpose for data retention doth cease (such as upon the completion of processing thy inquiry). Obligations mandated by law—especially those concerning the preservation of records—shall remain unaffected. Inquiry by Email, Telephone, or Facsimile: Shouldst thou reach us by way of email, telephone, or facsimile, thy request—together with all personal data thereby conveyed (such as thy name and inquiry)—shall be stored and processed for the purpose of attending unto thy concern. Such data shall not be disclosed unto others without thy consent. The processing of such data is undertaken upon the foundation of Article 6, Section 1, Letter b of GDPR, insofar as thy request doth pertain unto the fulfillment of a contract or is required for pre-contractual measures. In all other cases, processing doth rest upon our rightful interest in the efficient handling of queries directed unto us (Article 6, Section 1, Letter f GDPR), or upon thy consent (Article 6, Section 1, Letter a GDPR), if such consent hath been sought. This consent may be revoked at any time. The data thou dost transmit unto us through inquiries shall remain with us until such time as thou dost command its deletion, revoke thy consent unto its storage, or the purpose for data retention doth cease (such as upon the completion of handling thy concern). Obligations mandated by law—especially those concerning the preservation of records—shall remain unaffected."
        }
}